doc/performance/optimization-20250221/optimized_multi.log
Running 1m test @ http://localhost:8080/points/consume
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   318.69ms   73.15ms   1.20s    90.42%
    Req/Sec   193.91     47.07   370.00     69.25%
  46375 requests in 1.00m, 8.72MB read
  Socket errors: connect 253, read 0, write 0, timeout 0
Requests/sec:    771.61
Transfer/sec:    148.52KB