doc/performance/optimization-20250221/optimized_single.log
Running 1m test @ http://localhost:8080/points/consume
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   455.73ms  165.36ms 853.32ms   72.28%
    Req/Sec    57.45     37.17   250.00     74.26%
  13160 requests in 1.00m, 2.50MB read
Requests/sec:    218.97
Transfer/sec:     42.52KB